app/controllers/pages_controller.rb

  def index
  	pp @users = User.all
  	pp @posts = Post.all
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"