app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["title", "test"], ["body", "test"], ["created_at", "2017-10-20 08:40:39.207597"], ["updated_at", "2017-10-20 08:40:39.207597"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "3"], ["updated_at", "2017-10-20 11:32:25.031989"], ["id", 3]]