app/controllers/postcomments_controller.rb

INSERT INTO "postcomments" ("text", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "test\r\n"], ["post_id", 9], ["user_id", 3], ["created_at", "2017-11-10 08:30:46.371981"], ["updated_at", "2017-11-10 08:30:46.371981"]]
---
def create
	params[:postcomment][:post_id] = params[:post_id]
	params[:postcomment][:user_id] = current_user.id
	@comment = Postcomment.create(postcomments_params)